/* 身份证练习
 * 把身份证号码中前17个数字和一下17个数字对应相乘
 * （7，9，10，5，8，4，2，1，6，3，7，9，10，5，8，4，2）
 * 把所有相乘结果求和用求和结果除以11取余数到下面11个数字中挑选一个
 * （1，0，X，9，8，7，6，5，4，3，2）挑出来的就应该是身份证号码中最后一个位数的内容
 * 编写程序根据身份证号码前17个数位的内容计算出最后一个数位的内容（分17次）
 */
#include<stdio.h>
int main(){
    int arr[17] = {0};
    int arr1[] = {7,9,10,5,8,4,2,1,6,3,7,9,10,5,8,4,2};
    char arr2[] = {'1','0','X','9','8','7','6','5','4','3','2'};
    int num = 0, sum = 0;
    printf("请输入身份证号码前17个数字！\n");
    for(num = 0;num < 17;num++){
        printf("第%d个数字：",num + 1);
        scanf("%d", &arr[num]);
    }
    for(num = 0;num < 17;num++){
        sum += arr[num] * arr1[num];
    }
    printf("最后一位数的内容是：%c\n", arr2[sum%11]);
    return 0;
}
